app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
      @users = User.all
---
INSERT INTO "users" ("age", "created_at", "major", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["age", 555], ["created_at", "2014-10-08 06:12:29.545413"], ["major", "CS"], ["name", "xcvbxv"], ["updated_at", "2014-10-08 06:12:29.545413"]]
SELECT "users".* FROM "users"